<a href="https://colab.research.google.com/github/cpaniaguam/CSC104/blob/main/CSC104_miniproject5_decisiontreeC4_5.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# CSC-104 Spring 2021: Mini-project 5: Decision Trees

## Main task
Implement a `decision_treee` function. 

### Suggestions

1. Feel free to use/adapt code from the [tree notebook](https://colab.research.google.com/drive/1l04cD6lrUKyrFnEH9IseQofdKo-Efno7) shown during our last meeting.

2. Your function must be able to do splits for both numerical and categorical variables (C4.5-type implementation ---  see relevant [textbook discussion](https://learn.zybooks.com/zybook/SALVECSC104PaniaguaSpring2021/chapter/12/section/3) and the corresponding Wikipedia [article](https://en.wikipedia.org/wiki/C4.5_algorithm#Algorithm)). A rough guide follows.

- Create base cases. From the Wikipedia article:

>All the samples in the list belong to the same class. When this happens, it simply creates a leaf node for the decision tree saying to choose that class.

>None of the features provide any information gain. In this case, C4.5 creates a decision node higher up the tree using the expected value of the class.

- Create or extend the functionality of the `split` function to allow splits for numerical and categorical variables.

In [ ]:
def decision_tree():
    pass
# The rest of your code goes here

In [15]:
import pandas as pd
import numpy as np
import seaborn as sns
titanic = sns.load_dataset('titanic')

## Secondary task

Consider the titanic dataset.

In [42]:
import pandas as pd
import seaborn as sns
titanic = sns.load_dataset('titanic')
titanic.head()

   survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0         0       3    male  22.0  ...   NaN  Southampton     no  False
1         1       1  female  38.0  ...     C    Cherbourg    yes  False
2         1       3  female  26.0  ...   NaN  Southampton    yes   True
3         1       1  female  35.0  ...     C  Southampton    yes  False
4         0       3    male  35.0  ...   NaN  Southampton     no   True

[5 rows x 15 columns]


Use your decision tree function on the titanic data set to predict the `survived` value for the following observation:

In [43]:
test_row = pd.DataFrame([{'pclass':2,'sex':'male',
                         'age':19,'sibsp':1,
                         'parch':4,'fare':200,
                         'embarked':'C','class':'Second',
                         'who':'child', 'adult_male':False,'deck':np.nan,
                         'embark_town':'Cherbourg','alone':False}])
test_row

   pclass   sex  age  sibsp  parch  ...    who adult_male deck embark_town  alone
0       2  male   19      1      4  ...  child      False  NaN   Cherbourg  False

[1 rows x 13 columns]

In [5]:
# your code goes here